let shakir = [
  {
    id: 0,
    category: "no category",
    poetry: [
      "میں سینہ چاک ظالم دا قلم دے نال کر ویساں",
      "امن کیتے میں ہر خطرے دی دوزخ توں گزر ویساں",
      "میڈے حالات دے اتے میڈے جزبات غالب ہن",
      "جے میں اجڑیم تاں کوئی ڈر نئیں جے قوم اجڑی تے مر ویساں",
    ],
  },
  {
    id: 1,
    category: "no category",
    poetry: [
      "کوئی امیری کیوں گھناں اپنی خدی کوں ویچ کے",
      "غم خریدن کوں تیار ہاں ہر خوشی کوں ویچ کے",
      "کئی جزا ڈے کے توں میڈے پیار دا سودا نا کر",
      "میں نی گھنداتیڈی جنت بندگی کوں ویچ کے",
    ],
  },
  {
    id: 2,
    category: "no category",
    poetry: [
      "توں مرضی نال جیکوں وی جوا یا مار کئیں پچھنڑے",
      "رعایا تیڈی گنگی ہے میڈا سردار کئیں پچھنڑے",
      "غریباں دے لحو دے نال وضو کر تے کعبے ونج",
      "تیڈے متھے تے محراب اے تیڈا کردار کئیں پچھنڑے",
    ],
  },
  {
    id: 3,
    category: "no category",
    poetry: [
      "شکل تیڈی ہے پر توں انسان کائنی",
      "جو انسان دی تیکوں پہچان کائنی",
      "ہے افسوس تیں تے او دشمن خدائی دا",
      "جو کلمہ وی پڑھدیں مسلمان کائنی",
    ],
  },
  {
    id: 4,
    category: "no category",
    poetry: [
      "دغاباز کوں،دلرُباسمجھی بیٹھن",
      "بَلا کوں اے بالاں دی ماسمجھی بیٹھن",
      "خدایا فرشتیں دا رب تھی رہ ونج",
      "مسلمان بُش کوں خدا سمجھی بیٹھن",
    ],
  },
  {
    id: 5,
    category: "no category",
    poetry: [
      "اِتھاں کہیں کوں مان وفاواں دا",
      "اَتے کہیں کوں نازاداواں دا",
      "اساں پیلے پتر درختاں دے",
      "ساکوں رہندے خوف ہواواں دا",
    ],
  },
  {
    id: 6,
    category: "no category",
    poetry: [
      "خلیفے تے شاہ دی رسائی تاں ڈیکھاں",
      "کرم تے ستم دی لڑائی تاں ڈیکھاں",
      "توں ہک پھینگ رحمت دی ایندے تے پاچا",
      "مَیں دوزخ دی شاکر وڈائی تاں ڈیکھاں",
    ],
  },
  {
    id: 7,
    category: "no category",
    poetry: [
      "نصیب ایجھے نہ ڈینہ ڈکھاوے",
      "جو وقت شاکرچا منہ وٹاوے",
      "شیطان کولھوں مَیں آپ بچساں",
      "منافقاں توں خدا بچاوے",
    ],
  },
  {
    id: 8,
    category: "no category",
    poetry: [
      "او میڈے اندر وی رہ کے میکوں",
      "نظر جو کائنی نظر دا کائنی",
      "نگاہِ شفقت ہِے اوندی اے وی",
      "جو یاد رہندے وِسردا کائنی",
    ],
  },
  // ۔۔۔۔۔۔۔۔۔۔۔۔۔۔۔۔۔۔۔۔ڈوہڑے۔۔۔۔۔۔۔۔۔۔۔
  {
    id: 9,
    category: "no category",
    poetry: [
      "بے وزنے ہَیں تیڈی مرضی ہِے بھانویں باں وچ پابھاویں سیر اِچ پا",
      "پا چن دی چِٹی چاندنی وج یا رات دے سخت اندھیر اِچ پا",
      "بھاویں کہیں دشمن دی فوتکی تے یا جھمر دے کہیں پھیر اِچ پا",
      "راہ رُلدے شاکر کنگن ہیں بھاویں ہتھ اِچ پا بھاویں پیر اِچ پا",
    ],
  },
  {
    id: 10,
    category: "no category",
    poetry: [
      "کجھ عرصہ اندھے چور طرحاں اونکوں پیار کریندے رہ گیسے",
      "کئی سال وَلا اظہار کیتے الفاظ گولیندے رہ گیسے",
      "وَل موقع محل دی تاڑدے وچ ایویں وقت ونجیندے رہ گیسے",
      "سِوی شاکر کھٹ کوں چٹ گئیءِاساں وان وٹینڈےرہ گیسے",
    ],
  },
  {
    id: 11,
    category: "no category",
    poetry: [
      "(شکوہ)",
      "میڈی سوچ تے پانی پھیر سجن دِتو کھیڈ ونجا میڈا کیا رہ گے",
      "میڈا امن سکون آرام خوشی کِیتوں لُون سُوا میڈا کیا رہ گے",
      "کر ختم جوانی شاکر دی ڈِتو کمر نِوا میڈا کیا رہ گے",
      "میڈے شکوے تےاعتبار نہ کر چلو آپ ڈسا میڈا کیا رہ گے",
    ],
  },
  {
    id: 12,
    category: "no category",
    poetry: [
      "(جوابِ شکوہ)",
      "تیڈا روون کوڑ دا روون ہِے اَجاں روون جوگا حال نِوھی",
      "تیڈے زور جِتی تیکو بار ڈِتم ڈِٹھا درداں دا گڑدھال نِوھی",
      "جیکوں جو ڈیواں ذمے وار تاں نہیں میڈی قُدرت دا بھئیوال نِوھی",
      "میڈا شکوٰہ ہوش سنبھال تے کر توں شاکر ہَیں اقبال نوھی",
    ],
  },
  {
    id: 13,
    category: "no category",
    poetry: [
      "جیکوں ہووے سُنجان نہ اپنیاں دی اوں اپنے دی اپنیت کہیں",
      "کر رب دا ناں تے خرچ کرے بہہ کھاوے آپ خرائیت کہیں",
      "رَئی رکھ تے جہڑا عدل کرے اوں عادل دی پنچائت کہیں",
      "کھٹی چاویں شاکر کیتی دی وَل قسمت نال شکایت کہیں",
    ],
  },
  {
    id: 14,
    category: "no category",
    poetry: [
      "جہڑا کم ہایار رقیباں دا اوہو سجن کریندے رہ گِن",
      "جیکوں اپنا سمجھ تے حال ڈِتم میڈی پار پٹیندے رہ گِن",
      "لا تیلی میڈی جھوپری کوں ہتھ پیر سِکیندے رہ گِن",
      "بس شاکر بدلے پانی دے پٹرول سٹیندے رہ گِن",
    ],
  },
  {
    id: 15,
    category: "no category",
    poetry: [
      "ہُن کرم چاکر میڈی حالت تے میڈا مولا کرم نوازا",
      "توں واقف ہَیں ہر گالھ کنوں میڈے رازاں دا ہمرازا",
      "میڈیاں چیکاں دھاڑیں آہیں دا کڈاں سُنسیں سئیں آوازا",
      "کڈاں کھلسی شاکر دے کیتے تیڈی رحمت دا دروازا",
    ],
  },
  {
    id: 16,
    category: "no category",
    poetry: [
      "اَکھ پھڑکے پھڑکے پَئی پھڑکے ہاں پھڑکے نہ ہنج نی آندی",
      "ایہاڈکھ دی تار چوھائیں پاسوں کھڑ کھڑ کے نہ ہنج نی آندی",
      "جے ہجر فراق دی جگر دے وچ بھاہ بھڑکے نہ ہنج نی آندی",
      "ہنج شاکر عرق لہو دا ہے لہوں بڑکے نہ ہنج نی آندی",
    ],
  },
  {
    id: 17,
    category: "no category",
    poetry: [
      "ہِک شخص اسمان دو مُنہ کر کے کھڑ کیتی گال زمیں اُتے",
      "ہَئی دھاں فریاد زبان اُتے ہَن نیر نِگال زمین اُتے",
      "ٹِکے سیر ایمان وِکانداپے چھا گن دجال زمین اُتے",
      "جہڑے ہک ڈوں تیڈے ہِن شاکر تھی گِن پامال زمین اُتے",
    ],
  },
  {
    id: 18,
    category: "no category",
    poetry: [
      "ونج قاصد یار دے بُوہے کوں کھڑکاویں ہولے ہولے",
      "متاں نندر ہووے میڈے دِلبر کوں جگواویں ہولے ہولے",
      "جڈاں نندروں یار سُجاک تھیوے اَلواویں ہولے ہولے",
      "پچھے حال حویلہ شاکر دا سُنواویں ہولے ہولے",
    ],
  },
  {
    id: 19,
    category: "no category",
    poetry: [
      "کیتو سہی معنیاں وچ پیار سجن ول کامل ہئی ایمان سمجھ",
      "ایہو سچا پیار زبور سمجھ تو رات انجیل قرآن سمجھ",
      "جہڑابندہ پیار دا مُنکر ہے اونکوں کافر تے بائی مان سمجھ",
      "جہڑا شاکر پیار دا حامی ہے اونکوں پکا مسلمان سمجھ",
    ],
  },
  {
    id: 19,
    category: "no category",
    poetry: [
      "میکوں زندگی نک تے لڑگئی ہِے اَتے موت نی آندی نیڑے",
      "ڈکھ زوری آکے جُڑ بیٹھن سُکھ ٹُر گِن لا کے جھیڑے",
      "کڈاں مُکسی جھگڑا روح بُت دا آ تھیسن یار نبیڑے",
      "عزریل توں پچدے نِت شاکر کڈا آسیں میڈے ویہڑے",
    ],
  },
  {
    id: 20,
    category: "no category",
    poetry: [
      "جڈاں عید برات دا چندر ڈسے مَیں رورو نیر وَہا سُمداں",
      "لوکی جوڑے جوڑ ٹھہا رکھدن مَیں دکھ دی چادر پا سُمداں",
      "ڈہدے سجن سجن دی را شاکر مَیں تاریاں ڈو اکھ لا سُمداں",
      "ہر بُوہا تانگھ اِچ کُھل پوندے ہک مَیں ہاں طاق وَلا سُمداں",
    ],
  },
  {
    id: 21,
    category: "no category",
    poetry: [
      "ماریں آپ کُہاڑی پیراں تے وَل وَل عدل کیہاں نِروار کیہاں",
      "بہہ دانے چگنے کوڑکیاں دے پَھس پوونا تے پھتکار کیہاں",
      "کہیں پتھر دِل انسان اگوں تقریر کہیں تکرار کیہاں",
      "کھڑچاونی عشق دی پنڈ شاکر ول دھار کہیں ڈسکار کیہاں",
    ],
  },
  {
    id: 22,
    category: "no category",
    poetry: [
      "میکوں مینہ بادل دی کیا لوڑءِ میڈیں اَکھیں وچ برسات جو ہے",
      "میں ڈینہ خوشیاں دے منگاں کیوں میڈے کول ہجر دی رات جو ہے",
      "کیوں کئی شئے دی کُئی تات رکھاں ہک یار سجن دی تات جو ہِے",
      "مَیں کیوں نہ شاکؔرگل لاواں ڈکھ رب دی ڈتڑی ڈات جو ہے",
    ],
  },
  {
    id: 23,
    category: "no category",
    poetry: [
      "دِل منگ پووی تاں لنگھ آویں میڈے گھر دا سوکھا راہ ہِے",
      "ہاں واسی ڈکھ دے صوبے دا ضلع غم تحصیل جفا ہِے",
      "چند میل فراق دے موضعے توں ہک ہنجواں دا دریا ہِے",
      "جڈاں شاکؔر پرلھی مَن ٹپسیں اگوں سامنے میڈی جاہ ہے",
    ],
  },
  {
    id: 24,
    category: "no category",
    poetry: [
      "پِچھاں سَڈ عزریل کوں گِھن مولا میڈے حالتے کرم کریندا رہ",
      "میکوں جے تئیں یار نی مِل پوندا میڈے روح کوں مُہلت ڈیندا رہ",
      "کُئی لوڑنی میکوں زندگی دی ایکوں آکھ چا پحیرا پیندا رہ",
      "جڈاں شاکؔر یار مِلا ڈیسیں پِچھے آکھساں روحا ویندا رہ",
    ],
  },
  {
    id: 25,
    category: "no category",
    poetry: [
      "بَھلا خوشیاں کہیں کوں چَک پیندین خوشی کئی ٹھکرا پتہ لگ ویندے",
      "جہڑی چیخ پُکار کوں پھند آہدیں ایہو توں چابنا پتہ لگ ویندے",
      "جے روں ون اپنے وَس ہوندے توں رو ڈکھلا پتہ لگ ویندے",
      "جیویں عمر نبھی ہِے شاکؔر دی ہک منٹ نِبھا پتہ لگ ویسی",
    ],
  },
  {
    id: 26,
    category: "no category",
    poetry: [
      "اَے قسمت راہ وچ کَنڈیاں دا نہ جال کھنڈا مَیں دُھر پُجنے",
      "ہُن سوچ وچار دے وچ میڈا نہ وقت ونجا مَیں دُھر پُجنے",
      "میڈا ہُن تَیں رَستہ روکیا ہئی اَج رستہ لا مَیں دُھر پُجنے",
      "میڈا بُت جے شاکؔر پُجنڑ دا نی میڈا روح پُجوا مَیں دُھر پُجنے",
    ],
  },
  {
    id: 27,
    category: "no category",
    poetry: [
      "کیا حال سُناواں زندگی دا ڈتے جیندیں مار غریبی",
      "گُمنام قبر وج دفن کیتا میڈا ہَر کردار غریبی",
      "سُکے پَتراں وانگوں سُکھ لُڑھ گِن تھی ایجھی تار غریبی",
      "تھیا لکھ دا فائدا ہِک شاکؔر ڈتے سجن نتار غریبی",
    ],
  },
  {
    id: 28,
    category: "no category",
    poetry: [
      "میں تو مریضِ عشق ہوں معراج ہو عطا",
      "مُجھ کو شرابِ طور کا نُسخہ نہ دیجیے",
      "چُپتیں نہیں چُپانے سے شاکؔر حقیقتیں",
      "دریا کے رُخ پہ ریت کا پردہ نہ دیجئے",
    ],
  },
  {
    id: 29,
    category: "no category",
    poetry: [
      "ربَّاڈیہدا بیٹھاں تُر تُر کے تیڈی دُنیا تے جو تھیندا پے",
      "کوئی بُلھے شاہؒ،کوئی مہرعلیؒ،باہوسُلطانؒ سڈیندا پے",
      "کوئی کوٹ مٹھن دا شہزادہ وِج جگ دے ڈیکھ چُمیندا پے",
      "ہِک شاکؔر ہے تیڈی دُنیا تے جیڑھا مویاں لیکھے جِیندا پے",
    ],
  },
  {
    id: 30,
    category: "no category",
    poetry: [
      "میکوں ہُن تئیں ڈھیر ستایا ہئی ہک جَھٹ کھن تاں آرام چاڈے",
      "سَاری عمراں سکدیں گزری ہے اَج دِید وصال دا جام چا ڈے",
      "تِھیسو پوریاں اَج تیار ہو میڈیاں آساں کوں پیغام چا ڈے",
      "بہہ حال ونڈیسوں درداں دے میکوں شاکِؔر اَج دی شام چا ڈے",
    ],
  },
  {
    id: 31,
    category: "no category",
    poetry: [
      "تیکوں یاد ہوسی میں آکھیا ہم دِلدار مِٹھا توں چھوڑ ویسیں",
      "وَل وَل قرآن تے ہتھ نہ رکھ نہ قسماں چا توں چھوڑ ویسیں",
      "کجھ سوچ سمجھ تے فیصلہ کر نہ جوش ڈکھا توں چھوڑ ویسیں",
      "کہ شاکؔر کُوں بَرباد سجن بس لوک کِھلا توں چھوڑ ویسیں",
    ],
  },
  {
    id: 32,
    category: "no category",
    poetry: [
      "میڈا چن غیراں دِی محفل وِچ ہووی گُفت شنید مبارک",
      "میکوں میڈے خام نصیباں دَا ہر دَور شدید مبارک",
      "تیڈی سوچ تُوں وَدھ رُل شاکؔر کر گے ہووی یار مزید مبارک",
      "میکوں روندیں سَال دی رات وَلی تیکوں ڈوجھی عید مبارک",
    ],
  },
  {
    id: 33,
    category: "no category",
    poetry: [
      "جیویں نِبھدی پئی ھے گُزرن ڈے کُئی میڈا سُوچ وِچار نہ کر",
      "نہ پُچھ اے حالت کئیں کیتی ہمدردی دا اظہار نہ کر",
      "ھن لوک سیانے سمجھ ویسن میڈے درداں دا پرچار نہ کر",
      "متاں پہلا مُجرم توں ہوویں چَن شاکؔر دا نِروار نہ کر",
    ],
  },
  {
    id: 34,
    category: "no category",
    poetry: [
      "میں سُنیا ہا تیڈے در سَاقی پے مُفتے جَام ونڈیندن",
      "جیڑھے ہک واری جو پی گے ہن پے نال سکون دے جیندن",
      "تیڈے در تے آ معلوم تھیا پے دولت والے پیندن",
      "جیندے شاکؔر کھیسے خالی ہِن ودے وچ لتریندن",
    ],
  },
  {
    id: 35,
    category: "no category",
    poetry: [
      "کڈاں جان عذابوں وَنج چُھٹسی آ مُکسِن دور جگر دے",
      "میڈے دِل دے اندروں سُولاں دے نِت رہندوں کوٹ اُسردے",
      "گھانی ڈکھ دی جے تئیں چَالوھے نی سکھ دے بیڑے تردے",
      "ایہو غم سجناں دَا گِھن مَرسی جیڑھا شاکؔر حال نظر دے",
    ],
  },
  {
    id: 36,
    category: "no category",
    poetry: [
      "میکوں زندگی تک تے لڑ گئی ہے اَتے موت نی آندی نیڑے",
      "ڈکھ زوری آکے جُڑ بیٹھن سُکھ ٹُر گن لا کے جھیڑے",
      "کڈا مکسی جھگڑا روح بُت دَا آ تِھیسن یَار نبیڑے",
      "عزریل تُوں پُچھدے نِت شاکؔر کڈاں آسیں میڈے ویہڑے",
    ],
  },
  {
    id: 37,
    category: "no category",
    poetry: [
      "جنھاں سجناں تے اے دِل کملا رکھی اَج تئیں آس امید ریہے",
      "میکوں خواب ڈکھاتے خوشیاں دے ہتھوں بخشی درد شدید ریہے",
      "میکوں ڈیکھ تے ڈکھ دی سُولی تے میڈے یار نیندے عید ریہے",
      "سَاری دُنیا شاکؔر بدل گئی بے دِیداُنویں بے دید ریہے",
    ],
  },
  {
    id: 38,
    category: "no category",
    poetry: [
      "جڈاں سِر تے ڈکھ دی دُھپ ہاوی اتوں سُکھ دی چَھاں ہئی کَیں کیتی",
      "تیکوں سَارے چھوڑ کے بھج گے ہِن ہاوی نفرت کل ہمسائیں کیتی",
      "وَدہ مُل خرید غلاماں توں تیڈی یار غلامی میں کیتی",
      "بے عذرا چھوڑ کے شاکؔر کُوں وڈی نا انصافی تیں کیتی",
    ],
  },
  {
    id: 39,
    category: "no category",
    poetry: [
      "ڈٹھیاں شہر نصیب ءِچ ڈو شکلاں ہک پار تے ہِک اُروار دی ہَئی",
      "ہئی ہک تے بار خزاداں رُت بئی تے چیتر بہار دی ہئی",
      "ہِک ناز بھری ہئی پردے وچ اَتے بئی کوں طلب دیدار دی ہئی",
      "نا جان جو شاکؔر زندگیاں ہَن ہِک میڈی ہئی ہک یار دی ہئی",
    ],
  },
  {
    id: 40,
    category: "no category",
    poetry: [
      "کدی پیار پرانا نی تھیندا نہ سِک دا رُکھ کُملاندے",
      "نی کھٹدا جوش محبت دا نہ یاد توں مِلدی داندے",
      "نہ آس مِلن دی مُکدی ہے نہ ہجر چھوڑیندا پاندے",
      "توڑے شاکر ٹُرن توں عاجز ہے مُل کھڑدے راہ سجناں دے",
    ],
  },
  {
    id: 41,
    category: "no category",
    poetry: [
      "کوئی بئی سنگتی آ گال چلا میڈے دِلبر دی کوئی گال نہ پچھ",
      "نہ کہیں دے چئے دے نال تِھیوے جیڑھی کر گے میڈے مال نہ پُچھ",
      "میڈی پُھل جہی نازک دِلڑی کُوں جیویں چن کیتے پامال نہ پُچھ",
      "کوئی اپنا حال سنا شاکؔر میں اُجڑے دا کوئی حال نہ پُچھ",
    ],
  },
  {
    id: 42,
    category: "no category",
    poetry: [
      "نہ قاتل تھی جذباتاں دا احساس تا کر جو کیا تِھیسی",
      "آ سیک ویسی دِل زخمی کُوں سڑ جگر تے لُون سُوا تِھیسی",
      "نی لگنا چارا حکیماں دا نہ مرض دی مُول دوا تِھیسی",
      "مُک ویسی زندگی شاکؔر دی پچھے لنگھ آیوں تاں کیا تھیسی",
    ],
  },
  {
    id: 43,
    category: "no category",
    poetry: [
      "جیڑھے جیون وِچ نہ یار ملے ہوں جیون کولوں توبہ",
      "ہر روز جِگر کو پَھٹ لا کے نِت سِیون کولوں توبہ",
      "ایں بوتل غم دے دارو توں اَنج تِھیون کولوں توبہ",
      "جیندی مونجھ ہے شاکر مِل پووے میڈی پیون کولوں توبہ",
    ],
  },
  {
    id: 44,
    category: "no category",
    poetry: [
      "جو کر بیٹھیں سو کر بیٹھیں ھُن ڈھیر سجن دھرتال نہ کر",
      "کر ظلم تے بن مظلوم نہ بہہ ہک چال کنوں بئی چال نہ کر",
      "کِیتا کئیں برباد ہے شاکؔر کُوں ہتھوں اُلٹا یار سوال نہ کر",
      "میڈی ہر حسرت دا قاتل ہیں تیڈی مرضی جرم اقبال نہ کر",
    ],
  },
  {
    id: 45,
    category: "no category",
    poetry: [
      "ایویں جَھٹ کَھن یار منیجے  ہا اوندا لکھ اِحسان منیدے",
      "ایہے کپڑے لِیر کتیر لہا، نویں جوڑے پا ٹھمکیندے",
      "اوندے ہتھ وِچ سَادا ہَتھ ہوندا رَل پیار دی را نہ دسیندے",
      "چلو پچھلے پہرے وِچ شاکؔر کوئی ہک تاں عید کریندے",
    ],
  },
  {
    id: 46,
    category: "no category",
    poetry: [
      "میں دل نایاب وچیندا ہاں ہووے کوئی غرضاؤ تاں گال کرے",
      "بئی شرط شرائط وی کوئی کائنی بس سودا ہِک روح نال کرے",
      "ہوسی او مالک جیڑھا گِھن ویسی بانویں سا نبھے یا پامال کرے",
      "ہِک شاکؔراو نہ لنگھ آوے جیڑھا ڈوجھے کوں بھائیوال کرے",
    ],
  },
  {
    id: 47,
    category: "no category",
    poetry: [
      "جیڑھے غیر کُوں پگ بدھوائی بیٹھیں ایہو پاڑاں بٹ تے سَٹ ویسی",
      "ویسی شیشہ سب آ نظراجھو جڈاں کُوڑ دا پردہ ہٹ ویسی",
      "بیٹھا آکھسیں دھاڑ وو کیا تھی گے دل مغز سو چیندیں پھٹ ویسی",
      "تیکوں وَل سمجھوتے آ تِھیسن جڈاں شاکؔر جھوکاں بٹ ویسی",
    ],
  },
  {
    id: 48,
    category: "no category",
    poetry: [
      "جڈاں عِید برات دا چندر ڈسے میں رو رو نیر وہا سُمداں",
      "لوکی جوڑے جوڑ ٹھہا رکھدن میں ڈکھ دی چادر پا سُمداں",
      "ڈیہدے سجن سجن دی راہ شاکر میں تاریاں دو اکھ لا سُمدا",
      "ہر بوھا تانگھ ءِچ کُھل ویندے ہک میں ہاں جو طاق ول سُمدا",
    ],
  },
  {
    id: 49,
    category: "no category",
    poetry: [
      "گیاں مُفت تماشہ بن یارو ہک دید ءِچ دید رلاون وچ",
      "میں جتنا عجز نیاز کراں او راضی نئیں اَلواون وِچ",
      "نِت پیار دی کندھ اُسرینداں میں رہندے او مصروف ڈَہاوَن وِچ",
      "میکوں شاکؔر خوف دا یار دا ہے او خوش ہے لوک کِھلاون وچ",
    ],
  },
  {
    id: 50,
    category: "no category",
    poetry: [
      "میڈی زندگی وِگڑیا دھاگہ ہے اینکوں تَندا وُندا کوئی نی",
      "میڈے ٹوٹے کرتے سٹ ویندن اَتے گِندا گُندا کوئی نی",
      "میاں ہر کوئی چُندائے کلیاں کوں ڈَٹھے پُھل کوں چُندا کوئی نی",
      "ہُن بس کر شاکر روون دی تیڈی دھاڑ کوں سُندا کوئی نی",
    ],
  },
  {
    id: 51,
    category: "no category",
    poetry: [
      "میکوں درداں کیتے اَدھ مویا میڈے درد ونڈا میکوں آسرا ڈے",
      "میڈے اُجڑے پجڑے حال اُتے کر ترس ذرا میکوں آسرا ڈے",
      "چاپردہ بے پرواہی تو میں دو پھیر نگاہ میکوں آسرا ڈے",
      "نمہی تیں تئیں شاکر ٹر سگدا میڈے نیڑے آ میکوں آسرا ڈے",
    ],
  },
  {
    id: 52,
    category: "no category",
    poetry: [
      "اے ٹھیک ہے رب تیکوں حسن ڈتے پر ایڈا مان گھمنڈ نہ کر",
      "جیڑھے سُک کے ہن اجھو لہہ ویسن وَت سَاوے یار کھرنڈ نہ کر",
      "جے سَانجھ پیار دی پائی ہئی تاں بھائیوالی دی ونڈنہ کر",
      "میکوں بیشک شاکر کنڈ کر ونج دِل کعبہ ہے اینکوں کنڈ نہ کر",
    ],
  },
  {
    id: 53,
    category: "no category",
    poetry: [
      "میکوں ہول نہ رہے جو روندا گے ذرا کھلدیں شکل ڈکھالی ونج",
      "متاں راہ وِچ پووی رات سجن میڈے خون دا ڈیوا بالی وَنچ",
      "تو ٹر جو ائیں میکوں نئیں ٹھہندی میڈے در توں خالی وَنج",
      "بیا کجھ نی شاکر کی ڈیواں ایہے ساہ ہن یار سنبھالی وَنج",
    ],
  },
  {
    id: 54,
    category: "no category",
    poetry: [
      "بَن نانگ محبت ٹُر گئی ہِیں  چا رگ رگ زہر کھنڈایو",
      "ہتھ کاسہ ڈے مجبوری دا میکوں دَر دَر تے پنوایو",
      "کَھس باز انداز تے لاڈ سبھے میکوں ڈکھ دریا جھگڑایو",
      "لا روگ جِگر دَا شاکؔر کوں ساری عُمراں خون روایو",
    ],
  },
  {
    id: 55,
    category: "no category",
    poetry: [
      "جیڑھا فجریں توں لا دیگر تئیں اوندی تانگھ تنگھیندا رہ گے",
      "کوئی جھٹ کَھن تھے اِنَّا لِلّٰہ اوندی زندگی دا ڈینہہ لہہ گے",
      "او قاصد نال تیار وی تھئے  اے سوچ کے ولدا بہہ گے",
      "بھلا مَراتاں ایہو شاکؔر گے کیڑھا کوٹ دا کِنگر ڈھہہ گے",
    ],
  },
  {
    id: 56,
    category: "no category",
    poetry: [
      "بے دید سجن دی یاری توں ایویں سُنج ہووے تاں ٹھیک ءِ",
      "بے دید کڈاہیں ڈُکھ سُکھ وِچ نہ تِھیسی مول شریک ءِ",
      "منگو وعدہ مِلن دا بُھل چک تے نِت ڈیسی غلط تریک ءِ",
      "کُتا پال کے شاکؔر کھیر پلا، بے دِید کنوں تاں ٹھیک ءِ",
    ],
  },
  {
    id: 57,
    category: "no category",
    poetry: [
      "ہِک تیر لگا وِچ سینے دے کوئی خبر نہ ہئی جو کیں ماریے",
      "میڈے سنگتیاں آکھیا پکڑ گِھنو اُوں ظالم کوں اے جیں ماریے",
      "میڈے سامنے غیر جو گذریے ھِن میں آکھیے یار انھائیں ماریے",
      "اُتوں چن شاکر دا پہنچ گیا فخر یج تے اَہدے میں ماریے",
    ],
  },
  {
    id: 58,
    category: "no category",
    poetry: [
      "جیویں میکوں آن روایا ہئی ایویں میں وانگوں پَل پَل روسیں",
      "ہک واری روتے تھک بہسیں دِل وَل دکھسی توں وَل روسیں ",
      "نہ ڈکھڑے آن ونڈیسی کوئی توں لا کندھیاں کوں گل روسیں",
      "بس شاکر فرق میعاد دا ہے میں اَج رونداں توں کل روسیں",
    ],
  },
  {
    id: 59,
    category: "no category",
    poetry: [
      "اجاں کے تئیں چن منصوبہ ہئی میڈا کے تئیں حال تباہ کرڑئیں",
      "میڈی کرماں ماری جندڑی تے اَجاں چُوکھا طلم جفا کرڑئیں",
      "ذمے لگا ہویا غیراں دااجاں کیہڑا فرض ادا کرڑئیں",
      "کوئی ککھ نی رہ گیا شاکر دا بے درد بِیا ڈس کیا کرڑئیں",
    ],
  },
  {
    id: 60,
    category: "no category",
    poetry: [
      "بہوں ڈکھ ڈیندیں رب سُکھ ڈیوی ہَتھ چا کھڑداں مجبور جو ہاں",
      "تیڈے رستے دو چن ہر ویلھے اَکھ لا کھڑدا مجبور جو ہاں",
      "سن چنگا مندا بول نیویں پا کھڑداں مجبور جو ھاں",
      "ڈے دھکے شاکؔر ٹور ڈیندیں ول آکھڑداں مجبور جو ہاں",
    ],
  },
  {
    id: 61,
    category: "no category",
    poetry: [
      "وڈی تانگھ رکھیم تیڈی عزریلا بیٹھاں تانگھ لہا اُتوں توں آگئیں",
      "ساری عُمر روندیں گزری ہے ملیے سکھ دا ساہ اُتوں توں آگئیں",
      "اَج قسمت ڈکھ دا شاکر کُوں ڈتے گول دَوا اُتوں توں آگئیں",
      "مَسیں قاصد یار منا کےاَئے وَدا بہندا ہا اُتوں تُوں آ گئیں",
    ],
  },
  {
    id: 62,
    category: "no category",
    poetry: [
      "تیڈا ہر کوئی ہے میڈا کوئی کائنی ہک توں ہاویں تاں توں ٹرپئیں",
      "نہ عذر، اُلانبھا، رُس رنج کئی، کئی کیتو ہاں نا ہوں ٹرپئیں",
      "ہئی ویہڑا خُلد برین وانگوں ساری کر کے بھبھن بھوں ٹرپئیں",
      "ہاوے گِنڑ مُنج شاکؔر پہلے دی سُکھ ایں ٹر پِن توں اُوں ٹُر پئیں",
    ],
  },
  {
    id: 63,
    category: "no category",
    poetry: [
      "دل منگ پووی تاں لنگھ آویں میڈے گھر دا سوکھا راہ ہے",
      "ہاں واسی ڈکھ دے صُوبے دا ضلع غم تحصیل جفا ہے",
      "چند میل فراق دے موضعے توں ہک ہنجواں دا دریا ہے",
      "جڈاں شاکر پَرلی من ٹپسیں اگوں سامنے میڈی جاہ ہے",
    ],
  },
  {
    id: 64,
    category: "no category",
    poetry: [
      "جڈاں زندگی پیار تُوں خالی ہئی وِچ درد الم شامل نہ ہا",
      "میڈے چار چوفیروں خوشیاں ہَن دِل سوکھا ہا بسمل نہ ہا",
      "کڈی پیار کریساں زندگی وِچ میڈا یار ارادہ تل نہ ہا",
      "کیڈا شاکؔر جادوگر نکلیے اوڈوں اکھ ٹکری ایڈوں دل نہ ہا",
    ],
  },
  {
    id: 65,
    category: "no category",
    poetry: [
      "اساں بھولے بھاہ سوہنا چن ماہی تیڈے نال چا پیار کتوسے",
      "تیڈے حُسن جمال کُوں ڈیک سجن وَنج اکھیاں چار کِتوسے",
      "بُھل اپنیاں سِدھیاں نیتاں تے کھڑ قول اقرار کِتوسے",
      "ساکوں اَج شاکر پچھتاوناں پے تیڈا کیویں اعتبار کتوسے",
    ],
  },
  {
    id: 66,
    category: "no category",
    poetry: [
      "بَھلا خوشیاں کہیں کُوں چک پیندن کوئی خُوشی ٹھکرا پتہ لگ ویندے",
      "جیڑھی چیخ پکار کوں پھند اَہدیں ایہو توں چا بنا پتہ لگ ویندے",
      "جے رووَن اپنے وَس ہوندے توں رو ڈکھلا بتہ لگ ویندے",
      "جیویں عمر نبھی ہے شاکر دی ہِک مِنٹ نبھا پتہ لگ ویندے",
    ],
  },
  {
    id: 67,
    category: "no category",
    poetry: [
      "جیڑھا کم ہا یار رقیباں دا اوہو سجن کرینے رہ گِن",
      "جیکوں اپنا سمجھ کے حال ڈتم میڈی پاڑ پٹیندے رہ گِن",
      "لا تیلی میڈی جھونپڑی کُوں ہَتھ پیر سِکیندے رہ گن",
      "بس شاکر بَدلے پانی دے پٹرول سٹیندے رہ گِن",
    ],
  },
  {
    id: 68,
    category: "no category",
    poetry: [
      "ہے عارضی رونق چہرے دی تے میڈے عارضی کھل مسکار اِن",
      "میڈے باہروں لیپ ہے خوشیاں دا اتے اندروں درد ہزار اِن",
      "ڈکھ ڈیندے مرن دیاں مارا پن رَت پیندے سوچ وچار اِن",
      "اوندی شاکر ایویں نبھدی ہے جیندے پتھراں نال پیار اِن",
    ],
  },
  {
    id: 69,
    category: "no category",
    poetry: [
      "نہ ایڈے اوڈے رُل یارا ہک جاہ دا خاص مَکیں تِھی بہہ",
      "یا میڈا بن یا غیر دا بن  ہینی ڈو چوںڑاں تُوں جَیں تھی بہہ",
      "یا گِر ونج میڈیاں نظراں توں یا دل دا تخت نشین تِھی بہہ",
      "اَج کشتی کو تاکر شاکؔر یا اوں تِھی بہہ یا ایں تِھی بہہ",
    ],
  },
  {
    id: 70,
    category: "no category",
    poetry: [
      "تیڈی ہاں وی میں تیڈی نہ وی میں اقرار وی میں انکار وی میں",
      "تیڈا پیار محبت نال میڈے،تیڈی نصرت دا اظہار وی میں",
      "تیڈیاں نعمتاں دا حقدار وی میں تیڈی کاوِڑ دا کِردار وی میں",
      "ہے شاکؔر گالھ عجیب جہیں تیڈا غیر وی میں تیڈا یار وی میں",
    ],
  },
  {
    id: 71,
    category: "no category",
    poetry: [
      "تیڈی آس دے خالی خانے کُوں میں بَھر وینداں توں وَل آ",
      "میں اپنی سُنج حویل دا ماری در وینداں تُوں وَل آ",
      "جیڑھی خواہش تیڈی مُدت دی ہئی پوری کر وینداں توں وَل آ",
      "ہووی آونا شاکؔر قبر اُتے میں مروینداں توں وَل آ",
    ],
  },
  {
    id: 72,
    category: "no category",
    poetry: [
      "تُوں سَاڈا بن نہ بن دِلبر ہے گالھ صفا اساں تیڈے ہیں",
      "دے جام وصال دے بھر ساکوں یا زہر پلا اساں تیڈے ہیں",
      "ساڈے دوہیں ہَتھ ہن اکھیاں تے جہیں قسم چوا اساں تیڈے ہیں",
      "رَکھ آپ غلامی وچ شاکؔر یا ویچ وَٹا اساں تیڈے ہیں",
    ],
  },
  {
    id: 73,
    category: "no category",
    poetry: [
      "ہر پُھل کلی کُملا ویسی گلزار دا ککھ نہ راہسی",
      "ڈھہہ پیار دا تاج محل ویسی گھر بار دا ککھ نہ راہسی",
      "جئیں کیتے دید حیاتی ہئی بیمار دا ککھ نہ راہسی",
      "تُوں شاکر پار لڈائی ویندیں اُروار دا ککھ نہ راھسی",
    ],
  },
  {
    id: 74,
    category: "no category",
    poetry: [
      "ایجھا من وِچ ڈاکہ حسن گھتیے جیندی جگ وچ یار مثل کائنی",
      "پٹیے زوری اَکھ دی تاکی تُوں بیا کہیں جہوں رستہ تِل کائنی",
      "پہرے دار عقل دی لاش اُتے ہِک خنجر پئے قاتل کائنی",
      "میں شاکؔر سینہ چھڑ مارئیے ہک کھول کھڑے تے دل کائنی",
    ],
  },
  {
    id: 75,
    category: "no category",
    poetry: [
      "کیڈا سوہنا وقت گزردا ہا جڈاں دِل وچ شوق صنم نہ ہا",
      "میڈے ہسدے وسدے ویہڑے وچ ڈکھ درداں دا کوئی کم نہ ہا",
      "میڈے خوشیاں پیر چمیندیاں ہَن کوئی خاص قِسم دا غم نہ ہا",
      "شفیع سیٹھ سڈیندا ہم شاکؔر میڈا لکھدا درد قلم نہ ہا",
    ],
  },
];
export default shakir;
